
public class Main {
    public static void main(String[] args) {
        task1();
        task2();
        task3();
    }


    /**
     * Объявление примитивных типов данных
     * Задание: объявить в методе все примитивные типы данных и вывести в консоль их значения
     * Требования:
     * 1. В методе должны быть переменные всех простых типов.
     * 2. В методе должны быть переменные только простых типов.
     * 3. Значения переменных должны отличаться от значений по умолчанию.
     * 4. Переменные должны иметь имя var + тип примитива без пробелов и подчеркиваний, например, переменная типа int должна называться varint
     */
    private static void task1() {
       FDD //здесь должен быть твой код
    }

    /**
     * Арифметические вычисления
     * Задача:
     * Реализовать метод и вывести в консоль результ его выполнения. Метод должен принимать на вход количество мониторов,
     * купленных компанией, и количество программистов в ней, а возвращает количество мониторов, которые никому не достанутся.
     * Подсказки:
     * 1)метод должен быть статическим(внутри статических методов видны только статические методы)
     * 2)вызывать новый метод нужно в методе task2(), а сам метод создать под методом task2()
     */
    private static void task2() {
        //здесь должен быть твой код
    }
    /*


    место для нового метода


     */


    /**
     * Задача:
     * Напиши публичный метод priceCalculation, который считает стоимость товара.
     * В метод передается цена товара (может быть дробной) и количество товара, метод должен возвращать итоговую цену покупки.
     * Результат метода возвращать в консоль
     * <p>
     * Пример ввода: 8.50, 2
     * Пример вывода: 17.0
     * <p>
     * Требования:
     * Сигнатура метода должна быть: priceCalculation(double price, int count)
     * Подсказки:
     * 1)Обрати внимание на пример вывода(тип данных)
     * 2)вызывать новый метод нужно в методе task3(), а сам метод создать под методом task3()
     */
    private static void task3() {
        //здесь должен быть твой код
    }
    /*


    место для нового метода


     */
}